# -*- coding: utf-8 -*-

""" Модуль common.py - сборник функций большинства программ. """

#                Автор: Л.М.Матвеев

pyscr = None

import sys

# Платформа
win = sys.platform in ('win32', 'win64')

# Кодировка символов в терминале
trm_code = ['utf8', 'cp866'][win]


#------------------------------------------------------------------------------
def printm(s):
    """ Печать Юникод-строк в терминал и скриптер.
        Автоматический перевод строки не производится. """
    if pyscr:
        sys.stdout.write(s)
    else:
        sys.stdout.write(s.encode(trm_code))
#..............................................................................

